junqiangwu/STM32_Projects/No_Hall_Bldc_FOC_Stm32/BLDC PMSM2 - 1/BLDC PMSM2/src/stm32f10x_hall.c
/*******************************************************************************
* Function Name  : TIMx_IRQHandler
* Description    : This function handles both the capture event and Update event 
*                  interrupt handling the hall sensors signal period measurement
*                  
*                  - On 'CAPTURE' event case:
*                    The spinning direction is extracted
*                    The electrical angle is updated (synchronized)
*                    If the average is initialized, the last captured measure is
*                    copied into the whole array.
*                    Period captures are managed as following:
*                    If too low, the clock prescaler is decreased for next measure
*                    If too high (ie there was overflows), the result is
*                    re-computed as if there was no overflow and the prescaler is
*                    increased to avoid overflows during the next capture
*                   
*                  - On 'UPDATE' event case:
*                    This function handles the overflow of the timer handling
*                    the hall sensors signal period measurement.
* Input          : 
*                  - On 'CAPTURE' event case:
*                    None
*                   
*                  - On 'UPDATE' event case: 
*                    None
*
* Output         : 
*                  - On 'CAPTURE' event case:
*                   Updates the array holding the 4 latest period measures, reset
*                   the overflow counter and update the clock prescaler to
*                   optimize the accuracy of the measurement.
*                   
*                  - On 'UPDATE' event case:
*                    Updates a Counter of overflows, handled and reset when next
*                    capture occurs. 
*
* Return         : None (Interrupt Service routine)
*******************************************************************************/
#if (defined HALL_SENSORS || defined VIEW_HALL_FEEDBACK)
#if defined(TIMER2_HANDLES_HALL)
void TIM2_IRQHandler(void)
#elif defined(TIMER3_HANDLES_HALL)
void TIM3_IRQHandler(void)
#else // TIMER4_HANDLES_HALL
void TIM4_IRQHandler(void)
#endif

{
  static u8  bHallState; 
  u8 bPrevHallState;

// Check for the source of TIMx int - Capture or Update Event - 
  if ( TIM_GetFlagStatus(HALL_TIMER, TIM_FLAG_Update) == RESET )
  {
    // A capture event generated this interrupt
    bPrevHallState = bHallState;
    bHallState = ReadHallState();
#if (HALL_SENSORS_PLACEMENT == DEGREES_120)    
    switch(bHallState)
    {
      case STATE_5:
        if (bPrevHallState == STATE_5)
        {
	 //a speed reversal occured 
         if(bSpeed<0)
         {
           bSpeed = POSITIVE_SWAP;
         }
         else
         {
           bSpeed = NEGATIVE_SWAP;
         }
        }
        else   
          if (bPrevHallState == STATE_6)
          {
           bSpeed = POSITIVE;
          }
          else 
            if (bPrevHallState == STATE_3)
            {
              bSpeed = NEGATIVE;
            }
		// Update angle
        if(bSpeed<0)
        {
          hElectrical_Angle = (s16)(S16_PHASE_SHIFT+S16_60_PHASE_SHIFT);
        }
        else if(bSpeed!= ERROR)
        {
          hElectrical_Angle = S16_PHASE_SHIFT;  
        }
        break;
             
    case STATE_3:
        if (bPrevHallState == STATE_3)
        {
		 //a speed reversal occured
         if(bSpeed<0)
         {
           bSpeed = POSITIVE_SWAP;
         }
         else
         {
           bSpeed = NEGATIVE_SWAP;
         }
        }
        else
          if (bPrevHallState == STATE_5)
          {
           bSpeed = POSITIVE;
          }
          else 
            if (bPrevHallState == STATE_6)
            {
              bSpeed = NEGATIVE;
            }
		// Update of the electrical angle
        if(bSpeed<0)
        {
          hElectrical_Angle = (s16)(S16_PHASE_SHIFT+S16_120_PHASE_SHIFT+
                                                            S16_60_PHASE_SHIFT);
        }
        else if(bSpeed!= ERROR)
        {
          hElectrical_Angle =(s16)(S16_PHASE_SHIFT + S16_120_PHASE_SHIFT);
        }
        break;  
      
      case STATE_6: 
        if (bPrevHallState == STATE_6)
        {
         if(bSpeed<0)
         {
           bSpeed = POSITIVE_SWAP;
         }
         else
         {
           bSpeed = NEGATIVE_SWAP;
         }
        }
        
        if (bPrevHallState == STATE_3)
        {
         bSpeed = POSITIVE; 
        }
        else 
          if (bPrevHallState == STATE_5)
          {
            bSpeed = NEGATIVE;
          }  
        if(bSpeed<0)
        {
          hElectrical_Angle =(s16)(S16_PHASE_SHIFT - S16_60_PHASE_SHIFT);  
        }
        else if(bSpeed!= ERROR)
        {
          hElectrical_Angle =(s16)(S16_PHASE_SHIFT - S16_120_PHASE_SHIFT); 
        }
        break;
        
      default:
        bSpeed = ERROR;
        break;
    }
#elif (HALL_SENSORS_PLACEMENT == DEGREES_60)    
    switch(bHallState)
    {
      case STATE_3:
        if (bPrevHallState == STATE_3)
        {
         if(bSpeed<0)
         {
           bSpeed = POSITIVE_SWAP;
         }
         else
         {
           bSpeed = NEGATIVE_SWAP;
         }
        }
        else          
          if (bPrevHallState == STATE_0)
          {
           bSpeed = POSITIVE;
          }
          else 
            if (bPrevHallState == STATE_6)
            {
              bSpeed = NEGATIVE;              
            }
        if(bSpeed<0)
        {
          hElectrical_Angle = (s16)(S16_PHASE_SHIFT+S16_120_PHASE_SHIFT);
        }
        else if(bSpeed!= ERROR)
        {
          hElectrical_Angle = (s16)(S16_PHASE_SHIFT+S16_60_PHASE_SHIFT);
        }
        break;
             
      case STATE_6:
        if (bPrevHallState == STATE_6)
        {
         if(bSpeed<0)
         {
           bSpeed = POSITIVE_SWAP;
         }
         else
         {
           bSpeed = NEGATIVE_SWAP;
         }
        } 
        else
          if (bPrevHallState == STATE_3)
          {
           bSpeed = POSITIVE;           
          }
          else 
            if (bPrevHallState == STATE_0)
            {
              bSpeed = NEGATIVE;
            }
        if(bSpeed<0)
        {
          hElectrical_Angle = (s16)(S16_PHASE_SHIFT-S16_120_PHASE_SHIFT);
        }
        else if(bSpeed!= ERROR)
        {
          hElectrical_Angle =(s16)(S16_PHASE_SHIFT + S16_120_PHASE_SHIFT+
                                                            S16_60_PHASE_SHIFT);
        }
        break;  
      
