junqiangwu/STM32_Projects/No_Hall_Bldc_FOC_Stm32/BLDC PMSM2 - 1/BLDC PMSM2/src/stm32f10x_hall.c
      case STATE_0:
        if (bPrevHallState == STATE_0)
        {
         if(bSpeed<0)
         {
           bSpeed = POSITIVE_SWAP;
         }
         else
         {
           bSpeed = NEGATIVE_SWAP;
         }
        } 
        else
          if (bPrevHallState == STATE_6)
          {
           bSpeed = POSITIVE;
          }
          else 
            if (bPrevHallState == STATE_3)
            {
              bSpeed = NEGATIVE;
            }
        
        if(bSpeed<0)
        {
          hElectrical_Angle =(s16)(S16_PHASE_SHIFT );  
        }
        else if(bSpeed!= ERROR)
        {
          hElectrical_Angle =(s16)(S16_PHASE_SHIFT - S16_60_PHASE_SHIFT);  
        }                      
        break;
        
      default:
        bSpeed = ERROR;
        break;
    }
#endif
   // A capture event occured, it clears the flag  	
	TIM_ClearFlag(HALL_TIMER, TIM_FLAG_CC1);
   
   // used for discarding first capture
   if (hCaptCounter < U16_MAX)
   {
      hCaptCounter++;
   }

   // Compute new array index
   if (bSpeedFIFO_Index != HALL_SPEED_FIFO_SIZE-1)
   {
      bSpeedFIFO_Index++;
   }
   else
   {
      bSpeedFIFO_Index = 0;
   }

   //Timeout Flag is cleared when receiving an IC
   HALL_ClrTimeOut();
   
   // Store the latest speed acquisition
   if (bGP1_OVF_Counter != 0)	// There was counter overflow before capture
   {
        u32 wCaptBuf;
        u16 hPrscBuf;

      wCaptBuf = (u32)TIM_GetCapture1(HALL_TIMER);        
      
      hPrscBuf = HALL_TIMER->PSC;

      while (bGP1_OVF_Counter != 0)
      {
         wCaptBuf += 0x10000uL;// Compute the real captured value (> 16-bit)
         bGP1_OVF_Counter--;
         // OVF Counter is 8-bit and Capt is 16-bit, thus max CaptBuf is 24-bits
      }
      while(wCaptBuf > U16_MAX)
      {
         wCaptBuf /= 2;		// Make it fit 16-bit using virtual prescaler
         // Reduced resolution not a problem since result just slightly < 16-bit
         hPrscBuf = (hPrscBuf * 2) + 1;
         if (hPrscBuf > U16_MAX/2) // Avoid Prsc overflow
         {
            hPrscBuf = U16_MAX;
            wCaptBuf = U16_MAX;
         }
      }
      SensorPeriod[bSpeedFIFO_Index].hCapture = wCaptBuf;
      SensorPeriod[bSpeedFIFO_Index].hPrscReg = hPrscBuf;
      SensorPeriod[bSpeedFIFO_Index].bDirection = bSpeed;
      if (RatioInc)
      {
         RatioInc = FALSE;	// Previous capture caused overflow
         // Don't change prescaler (delay due to preload/update mechanism)
      }
      else
      {
         if ((HALL_TIMER->PSC) < HALL_MAX_RATIO) // Avoid OVF w/ very low freq
         {
            (HALL_TIMER->PSC)++; // To avoid OVF during speed decrease
            RatioInc = TRUE;	  // new prsc value updated at next capture only
         }
      }
   }
   else		// No counter overflow
   {
      u16 hHighSpeedCapture, hClockPrescaler;   

      hHighSpeedCapture = (u32)TIM_GetCapture1(HALL_TIMER);
        
      SensorPeriod[bSpeedFIFO_Index].hCapture = hHighSpeedCapture;
      SensorPeriod[bSpeedFIFO_Index].bDirection = bSpeed;
      // Store prescaler directly or incremented if value changed on last capt
      hClockPrescaler = HALL_TIMER->PSC;

      // If prsc preload reduced in last capture, store current register + 1
      if (RatioDec)  // and don't decrease it again
      {
         SensorPeriod[bSpeedFIFO_Index].hPrscReg = (hClockPrescaler)+1;
         RatioDec = FALSE;
      }
      else  // If prescaler was not modified on previous capture
      {
         if (hHighSpeedCapture >= LOW_RES_THRESHOLD)// If capture range correct
         {
            SensorPeriod[bSpeedFIFO_Index].hPrscReg = hClockPrescaler;
         }
         else
         {
            if(HALL_TIMER->PSC == 0) // or prescaler cannot be further reduced
            {
               SensorPeriod[bSpeedFIFO_Index].hPrscReg = hClockPrescaler;
            }
            else  // The prescaler needs to be modified to optimize the accuracy
            {
               SensorPeriod[bSpeedFIFO_Index].hPrscReg = hClockPrescaler;
               (HALL_TIMER->PSC)--;	// Increase accuracy by decreasing prsc
               // Avoid decrementing again in next capt.(register preload delay)
               RatioDec = TRUE;
            }
         }
      }
   }
    
   if (InitRollingAverage)
   {
        u16 hCaptBuf, hPrscBuf;
        s8 bSpeedAux;
        u32 wIndex;
      // Read last captured value and copy it into the whole array
      hCaptBuf = SensorPeriod[bSpeedFIFO_Index].hCapture;
      hPrscBuf = SensorPeriod[bSpeedFIFO_Index].hPrscReg;
      bSpeedAux = SensorPeriod[bSpeedFIFO_Index].bDirection;
      
      for (wIndex = 0; wIndex != HALL_SPEED_FIFO_SIZE-1; wIndex++)
      {
         SensorPeriod[wIndex].hCapture = hCaptBuf;
         SensorPeriod[wIndex].hPrscReg = hPrscBuf;
         SensorPeriod[wIndex].bDirection = bSpeedAux;
      }
      InitRollingAverage = FALSE;
      // Starting from now, the values returned by MTC_GetRotorFreq are averaged
      DoRollingAverage = TRUE;
    }
   
  //Update Rotor Frequency Computation
   hRotorFreq_dpp = HALL_GetRotorFreq();
  
  }
  else 
  {
    TIM_ClearFlag(HALL_TIMER, TIM_FLAG_Update);  
  	// an update event occured for this interrupt request generation
    if (bGP1_OVF_Counter < U8_MAX)
    {
       bGP1_OVF_Counter++;
    }
  
    if (bGP1_OVF_Counter >= HALL_MAX_OVERFLOWS)		 //≥¨ ±√ª∑¥”¶£¨‘ÚÀŸ∂»∑¥¿° ß∞‹
    {
       HallTimeOut = TRUE;
       hRotorFreq_dpp = 0;
    }    
  }
}

#endif // HALL_SENSORS defined

/******************* (C) COPYRIGHT 2008 STMicroelectronics *****END OF FILE****/
